DataProcessors/ЗагрузкаФактурыИзExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаФактурыИзExcel</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Фактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Фактура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлянцеваяПоверхность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйПостроитель_Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйПостроитель_Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРастяженияПоУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРастяженияПоХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаПолотна</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыФактур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаФактурыИзExcel/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВариантЗагрузки = Элементы.ВариантЗагрузки.СписокВыбора[0].Значение;
	НачСтр = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементовЗагрузки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузка(Команда)

	ТабЗнач.Очистить();
	
	Попытка
		ExcelПриложение = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить("Ошибка работы с Excel." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки;
	Попытка
		Файл = ExcelПриложение.WorkBooks.Open(ПутьКФайлу);
	Исключение
		Сообщить("Ошибка открытия файла." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки;
	
	Попытка
		Лист = Файл.Sheets(1);
		xlCellTypeLastCell = 11;
		ПоследняяСтрока = Лист.Cells.SpecialCells(xlCellTypeLastCell).Row;
	Исключение
		Сообщить("Ошибка открытия листа №1." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		ExcelПриложение.Quit();
		Возврат;
	КонецПопытки;
	
	Для Строка = НачСтр По ПоследняяСтрока Цикл
		Попытка
			Фактура = СокрЛП(Лист.Cells(Строка, НомерКолонкиНаименованиеФактуры).Text);
			Если Не Фактура = "" тогда 
				Стр = ТабЗнач.Добавить();
				Стр.Фактура = СокрЛП(Лист.Cells(Строка, НомерКолонкиНаименованиеФактуры).Text);
				Стр.Цвет = СокрЛП(Лист.Cells(Строка, НомерКолонкиНаименованиеЦвета).Text);
				Стр.Ширина = СокрЛП(Лист.Cells(Строка, НомерКолонкиШирина).Text);
				
				//Стр.Фактура = Стр.Фактура + " (" + Стр.Ширина + ")";
				//Стр.Фактура = ОбменСEasyCeiling.ПолучитьНаименованиеФактуры(Стр.Фактура, Стр.Ширина); - при чтении наименование брать из файла, при загрузке будет формировать правильное
				
				//добавлено 2017-10-25
				Если ВариантЗагрузки = 2 Тогда
					Стр.КаталогФактуры = СокрЛП(Лист.Cells(Строка, НомерКолонкиКаталогФактуры).Text);
					Стр.НаименованиеНоменклатурыЦвета = ОбменСEasyCeiling.ПолучитьНаименованиеПленки(Стр.Цвет, Стр.Фактура, Стр.Ширина);
									
					// проверяем на дубли
					ОтборПоНаименованию = Новый Структура("НаименованиеНоменклатурыЦвета", Стр.НаименованиеНоменклатурыЦвета);
					НайденныеСтроки = ТабЗнач.НайтиСтроки(ОтборПоНаименованию);
					Если НайденныеСтроки.Количество() > 1 Тогда
						Сообщить("Невозможна загрузка фактур: согласно имеющимся правилам формирования наименования пленки происходит дублирование строки """ + 
							Стр.НаименованиеНоменклатурыЦвета + """. Измените порядок формирования наименования пленки в настройках программы или файл!");
						Возврат;
					КонецЕсли;
				КонецЕсли;
					
			КонецЕсли;
		Исключение
			Сообщить("Ошибка чтения строки файла." + Строка + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		КонецПопытки;
	КонецЦикла;
	ExcelПриложение.Quit();
	
	ОпределитьНоменклатуру();
	
	ПоказатьОповещениеПользователя ("Чтение файла завершено");
	
	Если ТабЗнач.Количество() > 0 Тогда
		Элементы.СоздатьФактуру.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.Загрузка.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФактуру(Команда)
	СоздатьФактуруНаСервере();
	ПоказатьПредупреждение(,"Создание фактуры завершено");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантЗагрузкиПриИзменении(Элемент)
	УстановитьВидимостьЭлементовЗагрузки();
	ТабЗнач.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр =  "Файлы Excel|*.xls;*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл Excel";
	ДиалогОткрытияФайла.Выбрать();
	ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовЗагрузки()
	ФлагВидимостиРасширенныйРежим = (ВариантЗагрузки = 2);
	Элементы.ГруппаНастроекРасширенныйРежим.Видимость = ФлагВидимостиРасширенныйРежим;
	Элементы.ТабЗначКаталогФактуры.Видимость = ФлагВидимостиРасширенныйРежим;
	Элементы.ТабЗначНаименованиеНоменклатурыЦвета.Видимость = ФлагВидимостиРасширенныйРежим;
	Элементы.ТабЗначБаза_ГруппаНоменклатуры.Видимость = ФлагВидимостиРасширенныйРежим;
	Элементы.ТабЗначБаза_НоменклатураЦвета.Видимость = ФлагВидимостиРасширенныйРежим;
КонецПроцедуры

&НаСервере
Процедура ОпределитьНоменклатуру()
	
	ПорядокФормированияНаименованияФактуры = Константы.ПорядокФормированияНаименованияФактуры.Получить();

	Для Каждого ТекущаяСтрока Из ТабЗнач Цикл
		Если ТекущаяСтрока.База_Фактура.Пустая() Тогда
			
			//ТекущаяСтрока.База_Фактура = Справочники.Фактура.НайтиПоНаименованию(ТекущаяСтрока.Фактура, Истина);
			ТекущаяСтрока.База_Фактура = Справочники.Фактура.НайтиПоНаименованиюИШирине(ТекущаяСтрока.Фактура, ТекущаяСтрока.Ширина);
			
			Если НЕ ТекущаяСтрока.База_Фактура.Пустая() И НЕ ТекущаяСтрока.База_Фактура.ЭтоГруппа Тогда
				ТекущаяСтрока.База_ГруппаФактуры = ТекущаяСтрока.База_Фактура.Родитель;
				ТекущаяСтрока.База_ШиринаПолотна = ТекущаяСтрока.База_Фактура.ШиринаПолотна;
				
				ТекущаяСтрока.База_Цвет = Справочники.ЦветФактуры.НайтиПоНаименованию(ТекущаяСтрока.Цвет, Истина, , ТекущаяСтрока.База_Фактура);
				Если ЗначениеЗаполнено(ТекущаяСтрока.База_Цвет) Тогда
					ЦветОбъект = ТекущаяСтрока.База_Цвет.ПолучитьОбъект();
					
					Если ВариантЗагрузки = 2 Тогда
						ТекущаяСтрока.База_НоменклатураЦвета = ЦветОбъект.Номенклатура;
						
						ТекущаяСтрока.База_ГруппаНоменклатуры = ?(ЗначениеЗаполнено(ТекущаяСтрока.База_НоменклатураЦвета), 
					                                              ТекущаяСтрока.База_НоменклатураЦвета.Родитель, Неопределено);
					КонецЕсли;
						
					//НоваяСтрока.База_НоменклатураОтличается = ?(НоваяСтрока.НаименованиеНоменклатуры = ЦветОбъект.Номенклатура.Наименование, Ложь, Истина);
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСсылкуНаФактуру(Фактура, ШиринаПолотна, КаталогФактуры, ИскомыйРодитель, ИскомаяСсылка)
	
	// определим каталог	
	Если ЗначениеЗаполнено(КаталогФактуры) Тогда
		ИскомыйРодитель = Справочники.Фактура.НайтиПоНаименованию(КаталогФактуры, Истина);
		Если НЕ ЗначениеЗаполнено(ИскомыйРодитель) ИЛИ НЕ ИскомыйРодитель.ЭтоГруппа Тогда
			// Создавать фактуру 
			Попытка
				ФактураОбъект = Справочники.Фактура.СоздатьГруппу();
				ФактураОбъект.Наименование = КаталогФактуры;
				ФактураОбъект.Записать();
				ИскомыйРодитель = ФактураОбъект.Ссылка;
			Исключение
				Сообщить("Ошибка создания группы фактуры """ + КаталогФактуры + """. " + ОписаниеОшибки());
				Возврат;
			КонецПопытки
		КонецЕсли;
	Иначе 
		ИскомыйРодитель = ГруппаДляНовойФактуры;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Фактура.Ссылка
		|ИЗ
		|	Справочник.Фактура КАК Фактура
		|ГДЕ
		|	НЕ Фактура.ЭтоГруппа
		|	И Фактура.Материал ПОДОБНО &Материал
		|	И Фактура.ШиринаПолотна = &ШиринаПолотна
		|	И Фактура.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Материал", Фактура);
	Попытка
		ШиринаПолотнаЧислом = Число(ШиринаПолотна);
	Исключение		
		Сообщить("Ошибка преобразования ширины в число, проверьте корректность заполнения фактуры " + Фактура + " с шириной " + ШиринаПолотна);
		Возврат;
	КонецПопытки;	
	Запрос.УстановитьПараметр("ШиринаПолотна", ШиринаПолотнаЧислом);
	Запрос.УстановитьПараметр("Родитель", ИскомыйРодитель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИскомаяСсылка = Выборка.Ссылка;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СоздатьФактуруНаСервере()
	
	Если НЕ ГруппаДляНовойФактуры.Пустая() Тогда
		Если НЕ ГруппаДляНовойФактуры.ЭтоГруппа Тогда
			Сообщить("Группой новой фактуры должна быть группа, а не элемент");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТабЗнач.Количество() = 0 Тогда
		Сообщить("Отсутствуют данные для загрузки");
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из ТабЗнач Цикл
		//создаем фактуру
		Если ТекущаяСтрока.База_Фактура.Пустая() и НЕ ПустаяСтрока(ТекущаяСтрока.Фактура) Тогда
			
			//проверим еще раз, т.к. фактуру могли создать в предыдущей строке
			ИскомыйРодитель = Неопределено;
			ИскомаяСсылка   = Неопределено;
			ПолучитьСсылкуНаФактуру(ТекущаяСтрока.Фактура, ТекущаяСтрока.Ширина, ТекущаяСтрока.КаталогФактуры, ИскомыйРодитель, ИскомаяСсылка);
			ТекущаяСтрока.База_Фактура = ИскомаяСсылка;
			ТекущаяСтрока.База_ГруппаФактуры = ИскомыйРодитель;

			Если НЕ ЗначениеЗаполнено(ИскомаяСсылка) Тогда
				НоваяФактура = Справочники.Фактура.СоздатьЭлемент();
				НоваяФактура.Родитель = ИскомыйРодитель;
				//НоваяФактура.Наименование = ТекущаяСтрока.Фактура;
				НоваяФактура.Наименование = ОбменСEasyCeiling.ПолучитьНаименованиеФактуры(ТекущаяСтрока.Фактура, ТекущаяСтрока.Ширина);
				НоваяФактура.Материал = ТекущаяСтрока.Фактура;
				НоваяФактура.ШиринаПолотна = ТекущаяСтрока.Ширина;
				НоваяФактура.Записать();
				
				ТекущаяСтрока.База_Фактура = НоваяФактура.Ссылка;
				ТекущаяСтрока.База_ГруппаФактуры = НоваяФактура.Родитель;
				ТекущаяСтрока.База_ШиринаПолотна = НоваяФактура.ШиринаПолотна;
			КонецЕсли;
			
		КонецЕсли;
		
		//создаем цвет
		Если НЕ ТекущаяСтрока.База_Фактура.Пустая() Тогда			
			Если ТекущаяСтрока.База_Цвет.Пустая() и НЕ ПустаяСтрока(ТекущаяСтрока.Цвет) Тогда
				// сначала создадим номенклатуру для цвета
				Попытка
					НоваяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
					Если ВариантЗагрузки = 2 И ТекущаяСтрока.База_НоменклатураЦвета.Пустая() Тогда
						
						ТекущаяСтрока.НаименованиеНоменклатурыЦвета = ОбменСEasyCeiling.ПолучитьНаименованиеПленки(ТекущаяСтрока.Цвет, ТекущаяСтрока.Фактура, ТекущаяСтрока.Ширина);
						ИскомыйЭлемент = Справочники.Номенклатура.НайтиПоНаименованию(ТекущаяСтрока.НаименованиеНоменклатурыЦвета, Истина);
						Если ИскомыйЭлемент.Пустая() Тогда
							НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
							ЭтоНовыйЭлементНоменклатура = Истина;
						Иначе
							НоваяНоменклатура = ИскомыйЭлемент.ПолучитьОбъект();
						КонецЕсли;
						
						НоваяНоменклатура.Наименование = ТекущаяСтрока.НаименованиеНоменклатурыЦвета;
						НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно;
						НоваяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
						НоваяНоменклатура.Родитель = ТекущаяСтрока.База_ГруппаНоменклатуры;
						НоваяНоменклатура.ШиринаПолотна = ТекущаяСтрока.База_Фактура.ШиринаПолотна; // №8266
						
						НоваяНоменклатура.Записать();
						
						ТекущаяСтрока.База_НоменклатураЦвета = НоваяНоменклатура.Ссылка;
					КонецЕсли;	
					
					НовыйЦвет = Справочники.ЦветФактуры.СоздатьЭлемент();
					НовыйЦвет.Владелец = ТекущаяСтрока.База_Фактура;
					НовыйЦвет.Номенклатура = НоваяНоменклатура.Ссылка;
					НовыйЦвет.Наименование = ТекущаяСтрока.Цвет;
					НовыйЦвет.Записать();
					
					ТекущаяСтрока.База_Цвет = НовыйЦвет.Ссылка;
					
					Если ВариантЗагрузки = 2 И ЭтоНовыйЭлементНоменклатура Тогда
						
						ЕдИзмАльтернативная = Справочники.ЕдиницыИзмерений.СоздатьЭлемент();
						ЕдИзмАльтернативная.Владелец = НоваяНоменклатура.Ссылка;
						ЕдИзмАльтернативная.Наименование = Справочники.КлассификаторЕдиницИзмерения.МетрПогонный;
						ЕдИзмАльтернативная.Коэффициент = НовыйЦвет.Владелец.ШиринаПолотна / 100;
						ЕдИзмАльтернативная.Записать();
						НоваяНоменклатура.АльтернативнаяЕдиницаИзмерения = ЕдИзмАльтернативная.Ссылка;
						НоваяНоменклатура.Записать();
					КонецЕсли;
				Исключение
					Сообщить("Ошибка создания цвета """ + ТекущаяСтрока.Цвет + """. " + ОписаниеОшибки());
					Возврат;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуПриИзменении(Элемент)
	Элементы.Загрузка.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НачСтрПриИзменении(Элемент)
	Элементы.Загрузка.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НомерКолонкиНаименованиеПриИзменении(Элемент)
	Элементы.Загрузка.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НомерКолонкиКоличествоПриИзменении(Элемент)
	Элементы.Загрузка.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НомерКолонкиКаталогФактурыПриИзменении(Элемент)
	Элементы.Загрузка.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДляНовойНоменклатурыПриИзменении(Элемент)
	Элементы.Загрузка.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

#КонецОбласти
